Garfield-1314/Cat-Food-Machine/src/sdkconfig.defaults
# Set target chip
CONFIG_IDF_TARGET="esp32s3"

# Cat board: module is N16R8 (has 8MB octal PSRAM) BUT the board routes
# GPIO35/36/37 (octal PSRAM data lines D2/D3/D4) to the ST7789 LCD (CLK/MOSI/CS).
# Enabling PSRAM causes MSPI bus contention -> boot hang -> TG1WDT reset loop.
# Keep PSRAM DISABLED on this board. Only enable on a board with free PSRAM pins:
# CONFIG_SPIRAM=y
# CONFIG_SPIRAM_MODE_OCT=y
# CONFIG_SPIRAM is not set

# OV2640 camera
CONFIG_CAMERA_OV2640=y
# ESP32-S3-EYE native camera format
CONFIG_CAMERA_OV2640_DVP_JPEG_320X240_50FPS=y

# Use large single-app partition (2MB factory partition)
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Console over the built-in USB-Serial-JTAG (chip ROM virtual serial port).
# Works from power-on / bootloader, stays connected across reboots, no USB-TTL needed.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# LVGL Configuration
CONFIG_LV_COLOR_16_SWAP=y

CONFIG_LV_MEM_SIZE_KILOBYTES=32
# CONFIG_LV_BUILD_EXAMPLES is not set

CONFIG_LV_FONT_MONTSERRAT_10=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# All debug output goes to the USB-Serial-JTAG virtual serial port
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Disable Task WDT
# CONFIG_ESP_TASK_WDT_EN is not set
# CONFIG_ESP_TASK_WDT_INIT is not set
# CONFIG_TASK_WDT is not set

# SNTP (Network Time Sync) Configuration
CONFIG_LWIP_SNTP_MAX_SERVERS=3
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
